In [ ]:
# Перед началом работы с библиотеками pandas и seaborn необходимо установить их в Python.
# Сделать это можно, исполнив данную ячейку
!pip3 install pandas
!pip3 install seaborn

In [33]:
import pandas as pd
import numpy as np
dff = pd.read_csv('StudentsPerformance.csv')
dff.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

In [35]:
dff.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [37]:
dff.shape #смотрим на количество строк и колонок

(1000, 8)

In [39]:
dff.groupby('gender').aggregate({'writing score' : 'mean'}) #считаем среднее

        writing score
gender
female      72.467181
male        63.311203

In [41]:
dff.size

8000

In [43]:
dff.iloc[0:3, 0:5]

,gender,race/ethnicity,parental level of education,lunch,test preparation course
0,female,group B,bachelor's degree,standard,none
1,female,group C,some college,standard,completed
2,female,group B,master's degree,standard,none

In [45]:
dff.iloc[0:5, 0:3]

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college
2  female        group B             master's degree
3    male        group A          associate's degree
4    male        group C                some college

In [49]:
dx = dff.iloc[[0, 3, 4, 7, 8]] #берём некоторые строки  ВСЕГДА СНАЧАЛА ИДУТ В УКАЗАНИИ СТРОКИ

In [51]:
dx.index = ['A', 'B', 'C',  'D', 'E'] # приписываем названия строкам

In [53]:
dx

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
A,female,group B,bachelor's degree,standard,none,72,72,74
B,male,group A,associate's degree,free/reduced,none,47,57,44
C,male,group C,some college,standard,none,76,78,75
D,male,group B,some college,free/reduced,none,40,43,39
E,male,group D,high school,free/reduced,completed,64,64,67

In [55]:
fg = dx[['gender']]

In [57]:
fg

   gender
A  female
B    male
C    male
D    male
E    male

In [ ]:
dx.iloc[:,0]

In [59]:
ghh = pd.read_csv('titanic.csv')

In [61]:
ghh.shape

(891, 12)

In [63]:
ghh.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object